"""
psycopg: установка и подключние, создание таблиц и составление запросов
ORM SQLAlchemy: установка, подключение и создание таблиц, составление запросов
"""


# postgresql
# psycopg - это драйвер 
# SQLAlchemy - это орм
"""
Вот список знаний, которыми должен обладать потенциальный Junior Python developer:

Уметь самообучаться, находить нужную информацию.

Иметь общие представления о том, что такое ОС и зачем она появилась.
Понимать что такое процесс и как он “живёт” в ОС.
Понимать что такое поток.
Понимать что такое сокеты и зачем они нужны.
Иметь представление о том, как устроен стек протоколов TCP/IP.

Понимать что такое Linux.
Уметь работать в sh.
Понимать что такое виртуализация и знать какие бывают типы.
Уметь настраивать виртуальные машины через vagrant или подобные инструменты.
Уметь работать с GIT(создавать ветки, разрешать конфликты, etc)

Понимать что такое ООП, на чём он основан и почему им удобно пользоваться.
Понимать что такое императивный и декларативный стиль.
Понимать что такое MVC
Понимать что такое декоратор(стандартный вопрос на собеседовании) и зачем он нужен.
Понимать что такое замыкание.
Понимать что такое интроскпекция.
Понимать асинхронную концепцию программирования.

Уметь работать с БД(хотя бы CRUD, join)
Уметь работать с nginx(хотя бы проксирование настроить)

(можно просто написать - “прочитать Лутца”, но выделю пару вопросов)
Знать чем отличаются new style классы от old style.
Знать чем отличаются Python2 от Python3
Знать чем отличается str от unicode и почему в программе нужно работать с unicode.
Понимать алгоритм импорта модулей в Python.
Понимать что такое генераторы и итераторы.
Понимать что такое дескрипторы.
Понимать что такое GIL и зачем он нужен.
Понимать что такое WSGI и зачем он появился.

+ Уметь писать тесты, понимать зачем это нужно.
+ Практические и теоритические основы по framework.
"""




"""
как установить виртуальное окружение

с начала заходим на папку в терминале пишем полный пкуть до текущей папки и настраиваем окружение
1. python -m venv venv  - создаем
2. source venv/bin/activate - активируем



работа с базами данных

1. psql -U name(sezim) 
2. \l
3. create database
4. drop database



после того как создали бд  нужно теперь создать обьект подключение 



execute - object cursor

"""






